# 결측치 처리하기
# 1. 행 또는 열 삭제 (결측치가 뒤지게 많고 상관관계가 전혀 없다면 열(컬럼) 삭제도 뭐) / (데이터 아깝)
# 2. 채워넣기 평균(mean) / 중앙,중위값(median) / 0(fillna) / 앞(ffill),뒤(bfill) 값 / 특정값 
# 3. 보간 - interpolate
# 4. 결측치데이터를 빼고 훈련시켜서 predict한다.
# 5. 부스팅 계열은 이상치, 결측치에 자유로운 편이라고 볼 수 있다.

import pandas as pd
import numpy as np
from datetime import datetime

dates=['8/10/2022','8/11/2022','8/12/2022',
       '8/13/2022','8/14/2022']
dates=pd.to_datetime(dates)
print(dates)
print('---------------------------------')
ts=pd.Series([2,np.nan, np.nan,8,10],index=dates) 
print(ts)
print('----------------------------------')
ts=ts.interpolate()
print(ts)

# --------------------------------------------------------
# 2022-08-10     2.0
# 2022-08-11     NaN
# 2022-08-12     NaN
# 2022-08-13     8.0
# 2022-08-14    10.0
# dtype: float64
# --------------------------------------------------------
# 2022-08-10     2.0
# 2022-08-11     4.0
# 2022-08-12     6.0
# 2022-08-13     8.0
# 2022-08-14    10.0